Revit 2027 API
LoadedFamilyIntegrityCheck.CheckAllFamilies Method
 Check that all families loaded in the host document have their content documents.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool CheckAllFamilies(
	Document ADoc,
	ISet<ElementId> corruptFamilyIds
)
Public Shared Function CheckAllFamilies (
	ADoc As Document,
	corruptFamilyIds As ISet(Of ElementId)
) As Boolean
public:
static bool CheckAllFamilies(
	Document^ ADoc,
	ISet<ElementId^>^ corruptFamilyIds
)
static member CheckAllFamilies :
        ADoc : Document *
        corruptFamilyIds : ISet<ElementId> -> bool
Parameters
ADoc Document
 The host document.
corruptFamilyIds ISet<ElementId>
 Return ids of families that need to be reloaded because their content documents are missing.
Return Value
Boolean
 Returns true if all loaded families have their content documents.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
LoadedFamilyIntegrityCheck Class
Autodesk.Revit.DB Namespace